[Reference](https://towardsdatascience.com/working-with-missing-values-in-pandas-5da45d16e74)

In [1]:
import numpy as np
import pandas as pd

arr1 = np.array([1, None, 2, 3])
arr1

array([1, None, 2, 3], dtype=object)

In [2]:
arr2 = np.array([1, np.nan, 3, 4]) 
arr2.dtype

dtype('float64')

In [4]:
print(arr2.sum())
print(arr2.min())
print(arr2.max())

nan
nan
nan

In [6]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [7]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [8]:
x[0] = None

In [9]:
x

0    NaN
1    1.0
dtype: float64

In [10]:
df = pd.read_csv("source.csv", na_values = ['?', '&'])

In [11]:
df_clean = df.replace({ "?": np.nan, "&": np.nan })

In [12]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'A': [20, 15, 20],
                  'B': [np.nan, 50, 4],
                  'C': [30, 5, 30,],
                  'D': [15, 2, np.nan],
                  'E': [8, 5, 10],
                  'F': [45, 7, np.nan],
                  'G': [35, 10, 35]},
                  index = ['Row 1', 'Row 2',  'Row 3'])
df

        A     B   C     D   E     F   G
Row 1  20   NaN  30  15.0   8  45.0  35
Row 2  15  50.0   5   2.0   5   7.0  10
Row 3  20   4.0  30   NaN  10   NaN  35

In [13]:
df.isnull()

           A      B      C      D      E      F      G
Row 1  False   True  False  False  False  False  False
Row 2  False  False  False  False  False  False  False
Row 3  False  False  False   True  False   True  False

In [14]:
df.notnull()

          A      B     C      D     E      F     G
Row 1  True  False  True   True  True   True  True
Row 2  True   True  True   True  True   True  True
Row 3  True   True  True  False  True  False  True

In [15]:
df.isnull().sum()

A    0
B    1
C    0
D    1
E    0
F    1
G    0
dtype: int64

In [16]:
df.isnull().sum().sum()

3

In [17]:
df.dropna(axis = 0)
df.dropna(axis = 1)

In [18]:
df.fillna(axis=0, method='ffill')